---
title: LinePattern
classe: Autodesk.Revit.DB.LinePattern
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# LinePattern

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `linePattern.IsValidObject` | Boolean |
| `String Name { get; set; }` | `linePattern.Name` | String |
| `Void Dispose()` | `linePattern.Dispose()` | Void |
| `IList<LinePatternSegment> GetSegments()` | `linePattern.GetSegments()` | IList<LinePatternSegment> |
| `Void SetSegments(IList<LinePatternSegment>)` | `linePattern.SetSegments(lineSegs)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```